tutorials/verificationAndValidation/atmosphericModels/atmForestStability/setups.orig/common/0.orig/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0.0;

boundaryField
{
    "(bottom|top)"
    {
       type             fixedFluxPressure;
       rho              rhok;
       value            uniform 0;
    }

    "(inlet|outlet|left|right)"
    {
        type            cyclic;
    }
}


// ************************************************************************* //
